examples/openfoam13/FoamPilotCases/propellerFoundation13/system/forces
type            forces;
libs            ("libforces.so");
writeControl    timeStep;
writeInterval   1;
log             yes;
patches         (propellerStem propellerTip);
rho             rhoInf;
rhoInf          1000;
CofR            (0 0 0);
pitchAxis       (0 1 0);
